{
    "_type": "news",
    "didUMean": "",
    "totalCount": 769,
    "relatedSearch": [],
    "value": [
        {
            "id": "1457828509561033676",
            "title": "Portals of Kedarnath, Badrinath open in Uttarakhand after 6-month winter break",
            "url": "https://www.financialexpress.com/photos/entertainment-gallery/2254060/portals-of-kedarnath-badrinath-open-in-uttarakhand-after-6-month-winter-break-see-photos/",
            "description": "The famous temple of Badrinath in the upper Himalayan region of Uttarakhand opened after the winter break early on Tuesday amid traditional rituals.",
            "body": "Portals of Kedarnath, Badrinath open in Uttarakhand after 6-month winter break  SeePhotos\nBy:\nFE Online\nMay 18, 2021 1:55 PM\nThe famous temple of Badrinath in the upper Himalayan region of Uttarakhand opened after the winter break early on Tuesday amid traditional rituals. On May 17, the portals of Kedarnath opened after a six-month winter break with the first puja being held by priests on behalf of Prime Minister Narendra Modi, officials said. Only a select few people attended the temple's opening ceremony in view of the second wave of COVID-19 pandemic. The chief priest of the Badrinath temple, Ishwar Prasad Namboodiri, opened the portals of the temple at 4.15 am chanting Vedic hymns and praying for the well-being of all.\nA Chardham Devasthanam Board official said the first puja was held by priests on behalf of the prime minister as the gates of the famous Himalayan temple were opened at 5 am. (PTI Photo)\nChamoli: In normal circumstances, thousands of people turn up at the high-altitude Badrinath temple dedicated to Vishnu to witness its opening ceremony. (PTI Photo)\nKedarnath: The yatra to the temple is temporarily suspended for the sake of people's safety, Uttarakhand Chief Minister Tirath Singh Rawat said, asking people to have virtual \"darshan\" of Baba Kedar and perform puja at home. (PTI Photo)\nChamoli: The Badrinath temple was decorated with around eight quintals of marigolds on the occasion. (PTI Photo)\nKedarnath Temple has been decorated with 11 quintals of flowers. However, in view of the pandemic, the famous Char Dham yatra has been suspended this time but the arrangement has been made for the devotees to have online 'darshan' in Rudraprayag. (PTI Photo)\nWith the opening of Badrinath, all the four Himalayan temples known as char dham are now open in Uttarakhand. (PTI Photo)\nSkip this Advertisement",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:55:42",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/photos/entertainment-gallery/2254060/portals-of-kedarnath-badrinath-open-in-uttarakhand-after-6-month-winter-break-see-photos/"
            }
        },
        {
            "id": "2313021055145762720",
            "title": "All time-low home loan rates: A never before opportunity for homebuyers",
            "url": "https://www.financialexpress.com/money/all-time-low-home-loan-rates-a-never-before-opportunity-for-homebuyers/2254083/",
            "description": "If rising housing affordability is any indication, India's residential real estate market will see increased sales in the coming months.",
            "body": "COVID-19: Know how home hospitalisation works in health insurance policies\nAs Indias Coronavirus vaccination campaign continues, the benefits of the vaccination program can be seen in the countrys real estate market. Following a record low in the previous two quarters due to a drastic increase in the number of infections, home sales in Indias prime residential markets increased by nearly 70% in the third quarter, with new supply also increasing significantly. Despite the general gloom, housing prices in key markets have begun to recover, indicating that consumers have recognized real estates value and want to take advantage of low home loan interest rates. Interest rates indeed significantly impacted the sales growth since the end-user had been anticipating it and had received it.\nIf rising housing affordability is any indication, Indias residential real estate market will see increased sales in the coming months. In 2021, the new housing supply will continue to be affordable and mid-segment as developers try to capitalize on high pent-up demand. However, there is speculation that the demand for residential real estate in India may be jeopardized due to the sharp increase in new coronavirus cases in India. As a result of the increase in cases, a large portion of India, especially Delhi, Maharashtra, Rajasthan, Odisha, and Gujarat, is now under restrictions, including part-lockdowns, weekend lockdowns, and night curfews, among other things. The second wave of the Covid-19 pandemic is causing concern in the sector. There would be no problem if logistics and supply chain support are available and migrant labor on site.\nHomebuyers can currently get home loans for as low as 6.65 per cent annual interest, despite the RBIs decision to keep the repo rate unchanged. In January 2020, the average home loan interest rate was 8%, which is a significant difference. However, buyers should make a quick decision of purchasing a home because the situation could change if the banking systems stance changes. Despite the RBIs decision to keep policy rates unchanged on April 7, 2021, SBIincreased home loan interest rates in April, indicating that banks might be moving away from the current historically low-interest rate regime.\nDue to the effects on demand, price growth in residential has also slowed in the last year. Even though they are feeling the heat of rising raw material costs, developers have refrained from raising prices. Overall, the market is ideal for homebuyers to realize their dreams before the market returns to the old interest rate regime and developers raise prices, which is expected to happen in the next 6-12 months.\n(By Prasoon Chauhan, Founder & CEO, BlackOpal)\nGet live Stock Pricesfrom BSE NSE US Marketand latest NAV, portfolio of Mutual Funds Check out latest IPO News Best Performing IPOs calculate your tax by Income Tax Calculator know markets Top Gainers Top Losers& Best Equity Funds Like us on Facebookand follow us on Twitter\nFinancial Express is now on Telegram. Click here to join our channeland stay updated with the latest Biz news and updates.",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:54:28",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/money/all-time-low-home-loan-rates-a-never-before-opportunity-for-homebuyers/2254083/"
            }
        },
        {
            "id": "3656398952844116263",
            "title": "Provident Fund: Left or lost job? Employees can now update date of exit",
            "url": "https://www.financialexpress.com/money/provident-fund-left-or-lost-job-employees-can-now-update-date-of-exit-heres-how/2254054/",
            "description": "Employees Provident Fund account: Left or lost a job? Employees can now update their date of exit on the EPFO portal upon leaving a job.",
            "body": "Provident Fund 2021: Special Deposit Scheme interest rate for Non-Government PF, Gratuity Fundsnotified\nFor updating the date of exit, employees need to visit the Member Unified Portal and login with UAN and password. After this, go to Manage and click on Mark Exit. Then chose PF Account Number from Select Employment dropdown. Now, click on Request OTP and enter the OTP sent on your Aadhaar linked Mobile Number. Then select the Checkbox and click ok. Your Date of Exit would now be updated successfully.\nHow to update date of exit on Employees Provident Fund (EPFO) portal\nHeres a step by step guide\nStep 1: Visit Member Unified Portal (https://unifiedportal-mem.epfindia.gov.in/memberinterface/)\nStep 2: Enter UAN, Password and CAPTCHA.\nStep 3: Go to Manage and Click Mark Exit\nStep 4: Choose PF Account Number from select employment drop down\nStep 5: Enter Date of Exit and Reason of Exit\nStep 6: Click on option Request OTP and enter OTP sent on your Aadhaar\nWhile switching jobs, it is advisable for PF account holders to transfer ones PF account to the new recruiter. Employees contribution to the Provident Fund account is exempted from tax under Section 80C of the Income Tax Act.\nGet live Stock Pricesfrom BSE NSE US Marketand latest NAV, portfolio of Mutual Funds Check out latest IPO News Best Performing IPOs calculate your tax by Income Tax Calculator know markets Top Gainers Top Losers& Best Equity Funds Like us on Facebookand follow us on Twitter\nFinancial Express is now on Telegram. Click here to join our channeland stay updated with the latest Biz news and updates.",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:44:25",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/money/provident-fund-left-or-lost-job-employees-can-now-update-date-of-exit-heres-how/2254054/"
            }
        },
        {
            "id": "5197854634621832155",
            "title": "Shilpa Medicare share price surges 26% in 2 days on tie-up with Dr Reddy's for Sputnik V COVID vaccine",
            "url": "https://www.financialexpress.com/market/shilpa-medicare-share-price-surges-26-in-2-days-on-tie-up-with-dr-reddys-for-sputnik-v-covid-vaccine/2254047/",
            "description": "Shilpa Medicare share price surged 13 per cent in intraday deals on BSE after the company tied up with Dr. Reddy's Laboratories (DRL) for production-supply of the Sputnik V, a COVID-19 vaccine.",
            "body": "Dr Reddys Laboratories rating  Add: A stable showing by thecompany\nRanawat also said that the markets will also wait for the remediation measures taken by the company in terms of USFDA form 483 towards for its unit 4 at Jadcherla Telangana although 86 per cent of its revenue of oncology products like Azacitidine, Erlotinib and cyclophosphamide will be exempted due to shortage in the US. Any news flow on this front will be a big positive for the company. Hence if anyone has a long-term view stock is a good buy, he added. Both Shilpa Biologicals and Dr. Reddys are also exploring the option to manufacture Sputnik Light, a single-dose version of the vaccine in the near future, which is again positive news for Shilpa Medicare.\nShilpa Medicare views Biologics as a strategic growth area and has made significant investments in setting up a High end, Flexible Biologics facility in Dharwad to cater to the requirements of the fast-growing biologics field, that include the adenoviral, subunit & DNA vaccines, Monoclonal antibodies and fusion proteins.\n(The stock recommendations in this story are by the respective research and brokerage firm. Financial Express Online does not bear any responsibility for their investment advice. Please consult your investment advisor before investing.)\nGet live Stock Pricesfrom BSE NSE US Marketand latest NAV, portfolio of Mutual Funds Check out latest IPO News Best Performing IPOs calculate your tax by Income Tax Calculator know markets Top Gainers Top Losers& Best Equity Funds Like us on Facebookand follow us on Twitter\nFinancial Express is now on Telegram. Click here to join our channeland stay updated with the latest Biz news and updates.",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:38:52",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/market/shilpa-medicare-share-price-surges-26-in-2-days-on-tie-up-with-dr-reddys-for-sputnik-v-covid-vaccine/2254047/"
            }
        },
        {
            "id": "8707453303190074126",
            "title": "Cyclone Tauktae impact: Mumbai witnesses highest ever rainfall records for May",
            "url": "https://www.financialexpress.com/lifestyle/science/cyclone-tauktae-impact-mumbai-witnesses-highest-ever-rainfall-records-for-may/2254037/",
            "description": "As the Cyclone Tauktae approached the western shoreline of India, Mumbai witnessed the wettest day ever for the month.",
            "body": "Cyclone Tauktae: Intense rain likely in Mumbai; 2 dead in Palghar, 1 in Thane\nIt is to note that the amount of rainfall may not be much of a concern as Mumbai is used to experiencing heavy rains during monsoon. Whats unique is that the city experienced such heavy rainfall in May, which is uncommon. According to the rainfall record data by the India Meteorological Department (IMD), between a decade (2011- 2021), both Colaba and Santacruz observatories have recorded rainfall only once in May only during the year 2017 and the rainfall was recorded at 3mm.\nApart from this, the cyclone also brought showers to Ratnagiri, where 364mm rainfall was recorded within 15 hours between Sunday and Monday. Citing a senior IMD official, the report noted that the cyclone has caused exceptionally heavy rainfall and this was not only limited to Maharashtra but also along the west coasts of Karnataka, Kerala and Goa. The cyclone started advancing from Lakshadweep.\nMeanwhile, the passing cyclone as well as extreme downpour caused by it resulted in severe water logging. This led to Mumbai authorities closing the airport and suspending local and mono-rail services in Mumbai on a temporary basis.\nGet live Stock Pricesfrom BSE NSE US Marketand latest NAV, portfolio of Mutual Funds Check out latest IPO News Best Performing IPOs calculate your tax by Income Tax Calculator know markets Top Gainers Top Losers& Best Equity Funds Like us on Facebookand follow us on Twitter\nFinancial Express is now on Telegram. Click here to join our channeland stay updated with the latest Biz news and updates.",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:31:12",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/lifestyle/science/cyclone-tauktae-impact-mumbai-witnesses-highest-ever-rainfall-records-for-may/2254037/"
            }
        },
        {
            "id": "2043454522656421385",
            "title": "Decarbonisation: Emission-free economic recovery",
            "url": "https://www.financialexpress.com/lifestyle/science/decarbonisation-emission-free-economic-recovery/2254028/",
            "description": "In the post-COVID world, green economic recovery has garnered significant attention as a win-win strategy to avoid the worst risks of the climate crisis.",
            "body": "Gujarat: Cyclone Tauktae leaves behind trail of destruction; 4 dead\nAmeliorating such environmental deterioration requires a national plan of action for the decarbonisation of our production and supply chain infrastructure. The decarbonisation plan entails a long-term strategy focusing on weaning off greenhouse gas (GHG) emissions primarily carbon dioxide because of its large share (76%) within the atmosphere. As of now, only 29 countries have submitted their long-term low greenhouse gas emission development strategies to the UNFCCC secretariat in accordance with the Paris agreement that obliged all parties to submit their plans by 2020. Additionally, this year will witness two important events in climate diplomacy; COP 26 in Glasgow UK and the review of the Paris agreements member states nationally determined contributions (NDC) submitted to UNFCCC.\nAccording to the Emission gaps report (2020) of the UNEP, the world is headed for a catastrophic 3c temperature rise way beyond the Paris agreements under the 2 C goal. Therefore, this makes the COP 26 a make or break summit to rejuvenate the global consensus on emission reduction. Unfortunately, the list of countries with a long-term decarbonisation strategy does not include the top emitters China, the USA, and India respectively, responsible for more than half of the global CO2 emissions. Singapore is the only Asian country out of the total 29 countries to have submitted a long-term emission reduction strategy to decarbonize its economy.\nIndia is the 5th most vulnerable country to climate risks with its extreme poor being the worst affected. In 2020, out of the ten most expensive climate change events, two were in India; Amphan the super cyclone, and the October floods in the NE region of India, profusely costing the economy. Even worse, India is home to 9 out of the 10 most polluted cities in the world and this trend extends to the entire South Asian continent that has 49 out of 50 most polluted cities in the world. Pollution is a growing Asian problem, which needs an urgent regional plan that can contribute towards reducing global temperatures. At this juncture, a holistic and forceful decarbonization strategy explicitly formulating milestones to scaling clean transportation, infrastructure, energy, and agriculture at low costs through innovation is urgently needed.\nWith the re-entry of the USA in the Paris agreement, substantial steps have been made towards emission reduction. The USA has committed to reducing 26-28 % of its emissions by 2030 and net-zero carbon emissions by 2050. India has constituted an apex committee for the Implementation of the Paris agreement. China in its recent 14th  five-year plan has laid out the roadmap for carbon neutrality by 2060, with an immediate reduction of 18% and 13.5% CO2 and energy intensity, respectively from 2021 to 2025 levels.\nQuantifying the amount of innovation required to replace all polluting technologies with cleaner sources is a daunting task. Innovation is at the center of our fight against climate change and for this reason, we need proactive International alliances on climate innovation across sectors especially the scientific community. During the Paris agreement (2016), a coalition of 24 countries + European Commission launched the Mission Innovation to foster and support the financing of greener technologies, and double the public investment in R&D of clean energy. Most importantly, we need to focus on climate literacy to extract human ingenuity from wherever possible similar to the development of COVID-vaccine in record time. As Bill Gates articulates in his recent book, How to avoid a climate disaster, Solving global warming would be the most amazing thing humanity has done.\n(The author is an independent analyst on Latin American and Sustainability affairs. Views expressed are personal and do not reflect the official position or policy of Financial Express Online. Twitter: @Alinyst)\nGet live Stock Pricesfrom BSE NSE US Marketand latest NAV, portfolio of Mutual Funds Check out latest IPO News Best Performing IPOs calculate your tax by Income Tax Calculator know markets Top Gainers Top Losers& Best Equity Funds Like us on Facebookand follow us on Twitter\nFinancial Express is now on Telegram. Click here to join our channeland stay updated with the latest Biz news and updates.",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:24:59",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/lifestyle/science/decarbonisation-emission-free-economic-recovery/2254028/"
            }
        },
        {
            "id": "814994524628387683",
            "title": "John Hopkins expert Dr. Amita Gupta on handling covid-19 & Indias future preparedness options",
            "url": "https://www.financialexpress.com/videos/health-amp-fitness-video/2254026/john-hopkins-expert-dr-amita-gupta-on-handling-covid-19-indias-future-preparedness-options/",
            "description": "Dr Amita Gupta speaks to Financial Express Online on the lessons one could learn from the different waves of the Covid-19 infection.",
            "body": "John Hopkins expert Dr. Amita Gupta on handling covid-19 & Indias future preparednessoptions\nBy:",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:20:43",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/videos/health-amp-fitness-video/2254026/john-hopkins-expert-dr-amita-gupta-on-handling-covid-19-indias-future-preparedness-options/"
            }
        },
        {
            "id": "6151095730791356393",
            "title": "Over 4.22 lakh homes in top 7 cities to be completed in 2021 may get delayed",
            "url": "https://www.financialexpress.com/money/over-4-22-lakh-homes-in-top-7-cities-to-be-completed-in-2021-may-get-delayed/2254024/",
            "description": "There could be some delay due to restrictions and disruptions in the supply chain amid the second COVID-19 wave.",
            "body": "Your Queries - Loans: Can clear home loan online but collect original sale agreement\nIn terms of budget categories  of over 4.22 lakh homes to be delivered by 2021-end, 40% (approx. 1.69 lakh units if completed) are in the affordable segment priced <Rs 40 lakh. 35% (approx. 1.48 lakh units if completed) are in the mid-segment priced between Rs 40 lakh and Rs 80 lakh.\nCommenting on the same, Anuj Puri, Chairman, ANAROCK Property Consultants, says, The tally of 4.22 lakh homes scheduled for delivery across the top 7 cities by 2021-end must be viewed in context with the severe second wave of COVID-19 infections. All the top cities have been affected, and it is likely that a part of these project deliveries will be pushed to 2022. That said, many will see completion one way or the other. Amid the localized lockdowns and restrictions in most states, construction activities are permitted  albeit mandating COVID-19-specific protocols like adequate social distancing and sanitizing measures among in-situ construction workers.\nAlso, most developers underwent a steep learning curve since Lockdown 1.0. Since ready homes are in such high demand, many players with projects due to reach completion in 2021 will consider this as a do-or-die deadline. As far as housing sales is concerned, we are seeing a temporary slowdown due to the rampant spread of the coronavirus, says Puri. The market will quickly regain an even keel once the vaccination drive picks up pace and the health infrastructure crunch abate.\nCity-wise Expected Completions & Budget Range Cities\n# NCR has 1,16,730 units scheduled for completion in 2021. Of this, at least 43% are in the affordable segment, 39% in the mid segment, and 13% in premium segment priced within Rs 80 lakh to Rs 1.5 crore. Just 5% is within the luxury segment (>Rs 1.5 cr).\n# In MMR, 1,09,940 units are scheduled for completion during the year, of which 40% is in affordable segment, 24% in the mid segment, 18% in premium, and 17% in the luxury category.\n# Pune has 74,020 units scheduled for completion anytime during 2021. Of this supply, at least 59% is in the affordable segment, 30% in the mid segment, 9% in premium, and just 2% in the luxury segment.\n# In Bengaluru, 56,650 units are scheduled for completion in 2021 of which just 11% is in affordable segment, 56% is in the mid segment, 23% in the premium category and 9% in the luxury category.\n# Kolkata has 27,470 units scheduled for completion in 2021. Of this, at least 65% is in the affordable segment, 26% in the mid segment, 5% in premium, and just 3% in the luxury segment.\n# In Chennai, 21,830 units are scheduled for completion during the year. Of this, 34% is in the affordable segment, 47% in the mid segment, 14% in the premium category,\nand just 5% in the luxury category.\n# Hyderabad has 15,860 units scheduled for completion during 2021. Of this, just 6% is in the affordable segment, 37% in the mid segment and 43% in the premium segment. At least 14% is in the luxury segment.\nGet live Stock Pricesfrom BSE NSE US Marketand latest NAV, portfolio of Mutual Funds Check out latest IPO News Best Performing IPOs calculate your tax by Income Tax Calculator know markets Top Gainers Top Losers& Best Equity Funds Like us on Facebookand follow us on Twitter\nFinancial Express is now on Telegram. Click here to join our channeland stay updated with the latest Biz news and updates.",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:20:23",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/money/over-4-22-lakh-homes-in-top-7-cities-to-be-completed-in-2021-may-get-delayed/2254024/"
            }
        },
        {
            "id": "1019830712450130099",
            "title": "Expect Covid-19 containment from Aug but serious work ahead, says Global expert Bhramar Mukherjee",
            "url": "https://www.financialexpress.com/videos/health-amp-fitness-video/2254025/expect-covid-19-containment-from-aug-but-serious-work-ahead-says-global-expert-bhramar-mukherjee/",
            "description": "Bhramar Mukherjee, professor of Epidemiology and Biostatistics, School of Public Health, University of Michigan talks to Financial Express Online on her mathematical modelling of the covid-19 trajectory ahead with expectation of containment across Indian states not before August and on the serious work still on hand given the high viral caseload. She also talks of dealing with the gaps in data and on the policy implications for India.",
            "body": "Expect Covid-19 containment from Aug but serious work ahead, says Global expert BhramarMukherjee\nBy:",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:17:46",
            "provider": {
                "name": "financialexpress",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "financialexpress",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://www.financialexpress.com/videos/health-amp-fitness-video/2254025/expect-covid-19-containment-from-aug-but-serious-work-ahead-says-global-expert-bhramar-mukherjee/"
            }
        },
        {
            "id": "8925969941518643233",
            "title": "Vi Makes Rs. 49 Plan Free for Low-Income Users, Offers Double Talktime With Rs. 79 Plan Under COVID-19 Relief",
            "url": "https://gadgets.ndtv.com/telecom/news/vi-vodafone-idea-covid-relief-rs-49-plan-free-low-income-groups-double-talktime-79-airtel-2444339#rss-gadgets-telecom",
            "description": "Vodafone Idea (Vi) has announced special COVID-19 relief offers for its 60 million low-income customers. The telecom operator is offering the Rs. 49 recharge pack for free as a one-time offer. With this offer, Vi will be providing benefits of up to Rs. 294 crores to its low-income group users.",
            "body": "Telecom News\nVi Makes Rs. 49 Plan Free for Low Income Users, Offers Double Talktime With Rs. 79 Plan Under COVID 19 Relief\nVi Makes Rs. 49 Plan Free for Low-Income Users, Offers Double Talktime With Rs. 79 Plan Under COVID-19 Relief\nVi says with this offer, it will be providing benefits of up to Rs. 294 crores to its low-income group users.\nBy Vineet Washington|             Updated: 18 May 2021 18:41 IST\nVi has additional data offers with app and web recharges\nHighlights\nVi aims to assist its 60 million low-income customers\nVis Rs. 79 plan offers double talktime\nAirtel announced similar offers as well\nVi (Vodafone Idea) has announced special COVID-19 relief offers for its 60 million low-income customers. The telecom operator is offering the Rs. 49 recharge pack for free as a one-time offer. With this offer, Vi will be providing benefits of up to Rs. 294 crores to its low-income group users. It has also launched a new combo voucher that brings double the talktime for the same Rs. 79 recharge. Airtel also brought similar offers to assist people struggling with the COVID-19 pandemic and imposed lockdowns.\nVi\nhas two offers for its low-income group customers to help them during the pandemic and lockdowns. It is offering the Rs. 49 recharge pack free of cost as a one-time offer. This plan includes Rs. 38 talktime, 300MB data, and a validity of 28 days. Local/ national calls are charged at Rs. 0.25 per second. Vi also has an app/ web recharge exclusive offer that adds an extra 200MB to this plan.\nIn its press release, Vi states that the Rs. 49 plan is available to its 60 million low income customers and that it will be extending benefits worth up to Rs. 294 crores to these low-income groups. With this Vi is hopeful of enabling its customers to stay connected safely, and have access to all necessary information in these challenging times, it states.\nCaller Tune: How to Set Caller Tune on Vi (Vodafone Idea)\nIn addition to making the Rs. 49 recharge plan free for low income group, the telecom operator has also brought a new Combo Voucher RC79 that offers double the talktime. The typical Rs. 79 combo recharge includes Rs. 64 talktime, 200MB data, and 28-day validity. Now, this plan will come with Rs. 128 talktime while the other aspects remain the same. Vi is also offering 200MB extra data with app and website recharges.\nAirtel to Give Rs. 49 Recharge for Free, Double Benefits With Rs. 79 Plan\nAirtel\nalso announcedtoday that its Rs. 49 plan will be free of cost for its 55 million low income group customers as a one-time gesture. Its Rs. 79 prepaid plan now offers double benefits.\nIs Mi 11X the best phone under Rs. 35,000? We discussed this on Orbital the Gadgets 360 podcast. Later (starting at 23:50), we jump over to the Marvel series The Falcon and the Winter Soldier. Orbital is available on Apple Podcasts Google Podcasts Spotify Amazon Musicand wherever you get your podcasts.",
            "snippet": "",
            "keywords": "",
            "language": "en",
            "isSafe": true,
            "datePublished": "2021-05-18T13:11:52",
            "provider": {
                "name": "ndtv",
                "favIcon": "",
                "favIconBase64Encoding": ""
            },
            "image": {
                "url": "",
                "height": 0,
                "width": 0,
                "thumbnail": "",
                "thumbnailHeight": 0,
                "thumbnailWidth": 0,
                "base64Encoding": "",
                "name": null,
                "title": null,
                "provider": {
                    "name": "ndtv",
                    "favIcon": "",
                    "favIconBase64Encoding": ""
                },
                "imageWebSearchUrl": null,
                "webpageUrl": "https://gadgets.ndtv.com/telecom/news/vi-vodafone-idea-covid-relief-rs-49-plan-free-low-income-groups-double-talktime-79-airtel-2444339#rss-gadgets-telecom"
            }
        }
    ]
}